content/posts/What_are_good_sources_of_news.md
+++
title = "What are good sources of news?"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:24-04:00
slug = "What_are_good_sources_of_news"
draft = false
+++

## [questions]({{< relref "questions" >}}), [news]({{< relref "news" >}}) {#questions--questions-dot-md--news--news-dot-md}


## Links to sources for sharing {#links-to-sources-for-sharing}


### \* [PBS NewsHour: News, Analysis, Top Headlines, Live Coverage](<https://www.pbs.org/newshour/>) {#pbs-newshour-news-analysis-top-headlines-live-coverage--https-www-dot-pbs-dot-org-newshour}


## [The Correspondent](<https://thecorrespondent.com/>) {#the-correspondent--https-thecorrespondent-dot-com}


## [Stories \* Undark Magazine](<https://undark.org/stories/>) {#stories-undark-magazine--https-undark-dot-org-stories}


## [Latest \* The Atlantic](<https://www.theatlantic.com/latest/>) {#latest-the-atlantic--https-www-dot-theatlantic-dot-com-latest}


## [ProPublica — Investigative Journalism and News in the Public Interest](<https://www.propublica.org/>) {#propublica-investigative-journalism-and-news-in-the-public-interest--https-www-dot-propublica-dot-org}


## [Quanta Magazine – Illuminating Science | Quanta Magazine](<https://www.quantamagazine.org/>) {#quanta-magazine-illuminating-science-quanta-magazine--https-www-dot-quantamagazine-dot-org}


## [Foreign Affairs Magazine: analysis and debate of foreign policy, geopolitics and global affairs](<https://www.foreignaffairs.com/>) {#foreign-affairs-magazine-analysis-and-debate-of-foreign-policy-geopolitics-and-global-affairs--https-www-dot-foreignaffairs-dot-com}


## [PS \* The World's Opinion Page \* Project Syndicate](<https://www.project-syndicate.org/>) {#ps-the-world-s-opinion-page-project-syndicate--https-www-dot-project-syndicate-dot-org}


## [Bloomberg.com](<https://www.bloomberg.com/>) {#bloomberg-dot-com--https-www-dot-bloomberg-dot-com}


## [Hacker News](<https://news.ycombinator.com/>) {#hacker-news--https-news-dot-ycombinator-dot-com}
